Откуда данные: https://www.kaggle.com/c/titanic

In [ ]:
!ls -lh

---

In [2]:
import pandas as pd

In [3]:
train = pd.read_csv('../../data/00_titanic_train.csv')

In [31]:
type(train)

pandas.core.frame.DataFrame

## Описание данных

| Variable | Definition | Key |
|----------|------------|-----|
|survival | Survival | 0 = No <br> 1 = Yes|
|pclass | Ticket class | 1 = 1st = Upper <br> 2 = 2nd = Middle <br> 3 = 3rd = Lower |
|sex | Sex | |
|Age | Age in years |  |
|sibsp | # of siblings <br> spouses aboard the Titanic | |
|parch | # of parents <br> children aboard the Titanic | |
|ticket | Ticket number | |
|fare | Passenger fare | |
|cabin | Cabin number | |
|embarked | Port of Embarkation | C = Cherbourg <br> Q = Queenstown <br> S = Southampton|

<b>age</b><br>
    Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

<b>sibsp</b><br>
    The dataset defines family relations in this way...<br>
    Sibling = brother, sister, stepbrother, stepsister<br>
    Spouse = husband, wife (mistresses and fiancés were ignored)

<b>parch</b><br>
    The dataset defines family relations in this way...<br>
    Parent = mother, father<br>
    Child = daughter, son, stepdaughter, stepson<br>
    Some children travelled only with a nanny, therefore parch=0 for them.

---

## pandas: head, tail

https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.head.html

<i>DataFrame.head(n=5)</i><br>
&nbsp;&nbsp;&nbsp;&nbsp;Return the first n rows.

In [5]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
train.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [7]:
train.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

---

## pandas: shape

In [8]:
train.shape

(891, 12)

---

## pandas: columns, index

In [33]:
train.columns

PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

In [16]:
train.index

RangeIndex(start=0, stop=891, step=1)

## pandas: T

In [34]:
train.head(4).T

,0,1,2,3
PassengerId,1,2,3,4
Survived,0,1,1,1
Pclass,3,1,3,1
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th...","Heikkinen, Miss. Laina","Futrelle, Mrs. Jacques Heath (Lily May Peel)"
Sex,male,female,female,female
Age,22,38,26,35
SibSp,1,1,0,1
Parch,0,0,0,0
Ticket,A/5 21171,PC 17599,STON/O2. 3101282,113803
Fare,7.25,71.2833,7.925,53.1
Cabin,NaN,C85,NaN,C123
Embarked,S,C,S,S

In [35]:
transpose_train = train.T

In [ ]:
transpose_train

In [38]:
## pandas: columns, index, что теперь columns, а что index в transpose_train. Проверим на практике.

## ваш код :-)

RangeIndex(start=0, stop=891, step=1)
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

---

## pandas: info

In [39]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

---

## pandas: describe

In [46]:
train.mean(axis=1)

0        4.892857
1       16.326186
2        5.846429
3       13.585714
4        7.292857
5        2.909717
6       16.266071
7        5.439286
8        7.590471
9        8.295829
10       5.385714
11      14.078571
12       6.292857
13      13.325000
14       5.693457
15      12.857143
16       8.017857
17       5.666667
18      10.285714
19       5.204167
20      12.000000
21      10.285714
22       7.147029
23      12.785714
24       8.725000
25      15.055357
26       6.204167
27      45.142857
28       6.813200
29       6.815967
          ...
861    128.214286
862    134.132743
863    157.758333
864    129.142857
865    132.000000
866    130.265471
867    135.785114
868    146.916667
869    127.304757
870    129.699400
871    139.364886
872    130.285714
873    133.285714
874    133.000000
875    128.889286
876    129.977971
877    129.699400
878    148.315967
879    146.022614
880    133.714286
881    132.270829
882    131.216671
883    132.071429
884    131.435714
885    137.446429
886    132.714286
887    134.142857
888    153.075000
889    135.428571
890    133.392857
Length: 891, dtype: float64

In [41]:
train.describe(percentiles=[0.99])

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
99%,882.100000,1.000000,3.000000,65.870000,5.000000,4.000000,249.006220
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

---

## pandas: Series

In [ ]:
train['Name']

In [ ]:
list(train['Name'])

In [ ]:
## как пройти циклом for по всем именам? и вывести например всех 'John'

# ваш код :-)

---

## pandas: map

In [ ]:
'skillfactory'

In [ ]:
len('skillfactory')

In [ ]:
train['Name'].map(len)

In [ ]:
def is_Mr(s):
    return 'Mr.' in s

In [ ]:
train['Name'].map(is_Mr)

In [ ]:
train['Name'].map(lambda s: 'Mr' in s)

In [ ]:
train['is_Mr'] = train['Name'].map(lambda s: 'Mr.' in s)

In [ ]:
train.head()

In [ ]:
train['Name'].is_unique

In [ ]:
train['PassengerId'].is_unique

In [ ]:
train['Age'].is_unique

---

## pandas: select columns

In [ ]:
train.head()

In [ ]:
train[['PassengerId', 'Embarked', 'Pclass']].head()

---

## pandas: select rows

In [ ]:
train[train['Sex'] == 'male'].head()

In [ ]:
train[train['PassengerId'] == 666]

In [ ]:
train[train['Age'].isnull()].head()

In [ ]:
train[~train['Age'].isnull()].head()

In [ ]:
train[train['Embarked'].isin(['Q', 'C'])].head()

In [ ]:
## выбрать только те строки, где имя содержит Name

# ваш код :-)

In [ ]:
train[
    train['Embarked'].isin(['Q', 'C']) & (train['Age'] > 40)
].head()

In [ ]:
train[
    train['Embarked'].isin(['Q', 'C']) | (train['Age'] > 40)
].head()

---

## pandas: loc, iloc

In [ ]:
tmp = train[
    train['Embarked'].isin(['Q', 'C']) & (train['Age'] > 40)
].head()

In [ ]:
tmp

In [ ]:
tmp.loc[54:116, 'Pclass':'Parch']

In [ ]:
tmp.iloc[1:4, 2:8]

---

## pandas: sort

In [ ]:
train.sort_values('Name')

In [ ]:
train.sort_values('Fare', ascending=False)

---

## pandas: create from list

In [ ]:
pd.DataFrame(
    [
        [1,3],
        [2,4],
        [3,5]
    ]
)

In [ ]:
df_embarked = pd.DataFrame(
    [
        ['C', 'Cherbourg'],
        ['Q', 'Queenstown'],
        ['S', 'Southampton']
    ],
    columns=['id', 'City']
)

In [ ]:
df_embarked

---

## pandas: merge

https://pandas.pydata.org/pandas-docs/stable/merging.html

In [ ]:
pd.merge(
    train,
    df_embarked,
    left_on='Embarked',
    right_on='id'
)

---

## pandas: groupby

In [ ]:
train[['Age', 'Sex']].groupby('Sex').median()

## pandas: pivot_table

http://pbpython.com/images/pivot-table-datasheet.png

In [1]:
train.pivot_table('PassengerId', 'Pclass', 'Survived', 'count')

NameError: name 'train' is not defined